clc; clear; close all;
% 给定投资金额，规划投资计划，求得最大GDP值
%% 导入各个产业的拟合函数
% 定义变量
syms I2 I3 I4 I5 I6 I7 I8 I9 I10

GDP2 = 1.66 * I2 + 23419.39; % GDP2 函数
GDP3 = 40290.48 * I3^2 + 1.17 * I3 - 9.35e-7; % GDP3 函数
GDP4 = 46808.84 * exp(1.54e6 * I4) - 66777.28 * exp(5.57e-4 * I4); % GDP4 函数
GDP5 = -160800.24 * exp(1.83e-4 * I5) + 133611.89 * exp(2.44e-5 * I5); % GDP5 函数
GDP6 = 8147.80 * I6^2 + 0.28 * I6 + 3.86e-6; % GDP6 函数
GDP7 = 3711.69 * I7^2 + 0.35 * I7 + 2.88e-4; % GDP7 函数
GDP8 = 5.54e8 * exp(-6.69e-4 * I8) - 5.54e8 * exp(-6.70e-4 * I8); % GDP8 函数
GDP9 = -518.15 * I9^2 + 0.45 * I9 - 6.46e-7; % GDP9 函数
GDP10 = 205295.60 * exp(2.83e-7 * I10) - 190772.57 * exp(-9.04e-6 * I10); % GDP10 函数

% 定义总GDP（负值）
GDP_total = -(GDP2 + GDP3 + GDP4 + GDP5 + GDP6 + GDP7 + GDP8 + GDP9 + GDP10);
